{
  "backend/main.mo": "Main backend actor implementing user profiles, posts, comments, and likes with authorization checks using Map-based storage and access control mixins.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: user profiles, post feed, likes, comments, and UI design with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend source files including components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, including warm palette colors (coral, teal, amber).",
  "frontend/index.html": "HTML entry point for the Community Hub application with root div and module script reference.",
  "frontend/src/App.tsx": "Root component managing authentication flow, profile setup modal, and routing between login screen and feed page with header/footer.",
  "frontend/src/components/CommentForm.tsx": "Form component for submitting comments to posts with input field and send button, handling loading states.",
  "frontend/src/components/CommentItem.tsx": "Component displaying individual comment with author avatar, username, timestamp, and content in a rounded card layout.",
  "frontend/src/components/CommentList.tsx": "Component fetching and rendering all comments for a post with loading state and empty state handling.",
  "frontend/src/components/Header.tsx": "Header component displaying community icon, app title, and logout button with sticky positioning and backdrop blur.",
  "frontend/src/components/LikeButton.tsx": "Button component for liking posts displaying heart icon and like count with hover effects and loading state.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author avatar, username, timestamp, content, like button, and collapsible comments section. Includes helper functions for timestamp formatting and username initials.",
  "frontend/src/components/PostCreationForm.tsx": "Form component for creating new posts with a textarea input and submit button. Handles post creation with loading states and clears the form on success.",
  "frontend/src/components/PostFeed.tsx": "Fetches and displays all posts using the useGetAllPosts hook. Shows loading spinner or empty state message when appropriate.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup with username (required) and bio (optional) fields. Cannot be dismissed until profile is created.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useAddComment.ts": "React Query mutation hook for adding comments to posts. Invalidates the comments query for the specific post on success.",
  "frontend/src/hooks/useCreatePost.ts": "React Query mutation hook for creating new posts. Invalidates the allPosts query on success to refresh the feed.",
  "frontend/src/hooks/useGetAllPosts.ts": "React Query hook that fetches all posts from the backend. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile. Returns null if no profile exists and includes combined loading state from actor and query.",
  "frontend/src/hooks/useGetComments.ts": "React Query hook that fetches comments for a specific post by postId. Returns empty array when actor is unavailable.",
  "frontend/src/hooks/useGetLikeCount.ts": "React Query hook that fetches the like count for a specific post by postId. Returns 0n (bigint) when actor is unavailable.",
  "frontend/src/hooks/useGetUserProfile.ts": "React Query hook that fetches a user profile by userId. Returns null when actor is unavailable or profile doesn't exist.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality and identity state management. Includes provider component and hook for accessing authentication state throughout the app.",
  "frontend/src/hooks/useLikePost.ts": "React Query mutation hook for liking posts. Invalidates like count and allPosts queries on success, handles duplicate like errors gracefully.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook for creating or updating the current user's profile with username and bio. Invalidates currentUserProfile query on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm color palette (coral, teal, amber) for light and dark modes. Includes utility classes for brand colors and base styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM.",
  "frontend/src/pages/FeedPage.tsx": "Main feed page layout displaying a hero banner image, post creation form, and the post feed in a centered container.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography settings, container queries, animations, and design tokens for a modern UI with sidebar, chart, and card components.",
  "project_state.json": "Project state file tracking a community platform application with six implemented features including user profiles, post creation/feed, likes, comments, and a vibrant coral/teal themed UI with generated image assets."
}